### Forest Lotus Calibnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.lotus-calibnet.data.digitalocean_ssh_keys.keys: Reading...
module.lotus-calibnet.data.digitalocean_project.forest_project: Reading...
module.lotus-calibnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.lotus-calibnet.digitalocean_droplet.forest: Refreshing state... [id=362695820]
module.lotus-calibnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=1053b86a-9772-4064-82b4-24d3925db84f]
module.lotus-calibnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.lotus-calibnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lotus-calibnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-06-28T15:19:28Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "362695820" -> (known after apply)
      ~ ipv4_address         = "206.81.18.227" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.7" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "lotus"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "calibrationnet",
        ]
      ~ urn                  = "do:droplet:362695820" -> (known after apply)
      ~ user_data            = "5d3165b4d4fcd0d45d4405eb16d9fafb68d34cbb" -> "af65f94286c872d1e6a420d9dffed5f1276526d8" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.lotus-calibnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 362695820,
        ] -> (known after apply)
        id              = "1053b86a-9772-4064-82b4-24d3925db84f"
        name            = "lotus-calibnet-fw"
        tags            = [
            "calibrationnet",
        ]
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lotus-calibnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:362695820",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>